<?php

return [

   /*
    |--------------------------------------------------------------------------
    | Website Reset Language Lines
    |--------------------------------------------------------------------------
    */

   'LBI' => 'LBI',
   'home' => 'الصفحة الرئيسية',
   'about' => 'من نحن',
   'faqs' => 'الأسئلة الشائعة',
   'no_questions' => 'عفواً، لا يوجد أسئلة لعرضها',
   'terms_policy' => 'الشروط والاحكام',
   'no_terms' => 'عفواً، لا يوجد شروط لعرضها',
   'credit-rating' => 'التصنيف الائتماني',
   'fast_links' => 'روابط سريعة',
   //Ibrahim
   'contact_us' => 'تواصل معنا',
   'contact_us_title' => 'تواصل معنا او يمكنك ارسال رسالة وسيتم التواصل معك في اقرب وقت',
   'contact_created' => 'تم ارسال رسالتك بنجاح',

   'about_us' => 'عننا',

   'name' => 'الاسم',
   'phone' => 'رقم الجوال',
   'email' => 'البريد الالكتروني',
   'message' => 'رسالتك',
   'submit' => 'ارسال',

   'english' => 'الانجليزية',
   'arabic' => 'العربية',

   'finance' => 'احصل على تمويل',
   'invest' => 'استثمر',

   'articles' => 'المدونة',
   'no_articles' => 'لا يوجد مقالات',
   'published_in' => 'نشر في',
   'by' => 'بواسطة',

   'other_articles' => 'مقالات أخرى',
   'related_words' => 'كلمات ذات صلة',

   'rova' => 'رووفا'
];
